In [2]:
import pandas as pd

In [3]:
german_credit = pd.read_table("DATA/german.data")
german_credit.head()

  A11 6 A34 A43 1169 A65 A75 4 A93 A101 4 A121 67 A143 A152 2 A173 1 A192 A201 1
0  A12 48 A32 A43 5951 A61 A73 2 A92 A101 2 A121 ...
1  A14 12 A34 A46 2096 A61 A74 2 A93 A101 3 A121 ...
2  A11 42 A32 A42 7882 A61 A74 2 A93 A103 4 A122 ...
3  A11 24 A33 A40 4870 A61 A73 3 A93 A101 4 A124 ...
4  A14 36 A32 A46 9055 A65 A73 2 A93 A101 4 A124 ...

In [5]:
german_credit.describe()

       A11 6 A34 A43 1169 A65 A75 4 A93 A101 4 A121 67 A143 A152 2 A173 1 A192 A201 1
count                                                 999
unique                                                999
top     A12 48 A32 A43 5951 A61 A73 2 A92 A101 2 A121 ...
freq                                                    1